narmesk/testjules1/PIC18FREMOTE/glcd.c
void GLCD_String5x7(unsigned char x, unsigned char y, char *str);
void GLCD_StringArialBold14(unsigned char x, unsigned char y, char *str);
void GLCDPutChar_ArialBold14(unsigned char c);
void GLCD_Picture(char *str);
void GLCDWriteData(unsigned char data);
void GotoXY(unsigned char x, unsigned char y);
void GLCD_StringCalibri36(unsigned char x, unsigned char y, char *str);
void GLCDPutCharCalibri36(unsigned char c);
void GLCD_StringHead8x8(unsigned char x, unsigned char y, char *str);
void GLCDPutCharHead8x8(unsigned char c);
void GLCDPutCharDigMin(unsigned char c);
void GLCDPutSpecialCharDigMin(unsigned char c);
void GLCDPutSpecialCharDigMax(unsigned char c);
void GLCDPutCharDigMax(unsigned char c);
void GLCDPutCharDigMaxFirst(unsigned char c);
void GLCDPutCharDigMaxSecond(unsigned char c);
void GLCDPutChar5x7(unsigned char c);

// Dışarıdan bildirilen okuma/durum fonksiyonu
extern unsigned char GLCD_ReadStatus(unsigned char chip);

//-------------------------------------------------------------------------------------------------
// MCC Pin Makroları İle Donanım Çip Seçim Fonksiyonu (LMC19264A-01: 3 x 64x64 = 192x64)
// Active LOW Chip Select Yapısı
//-------------------------------------------------------------------------------------------------
void GLCD_Chip_Select_Direct(unsigned char Chip_idx)
{
    if (Chip_idx == 0) // Hiçbirini seçme (All Deselected)
    {
        CS1_SetHigh();
        CS2_SetHigh();
        CS3_SetHigh();
    }
    else if (Chip_idx == 1) // Sol 64 piksel (X: 0..63) -> CS1
    {
        CS1_SetLow();
        CS2_SetHigh();
        CS3_SetHigh();
    }
    else if (Chip_idx == 2) // Orta 64 piksel (X: 64..127) -> CS2
    {
        CS1_SetHigh();
        CS2_SetLow();
        CS3_SetHigh();
    }
    else if (Chip_idx == 3) // Sağ 64 piksel (X: 128..191) -> CS3
    {
        CS1_SetHigh();
        CS2_SetHigh();
        CS3_SetLow();
    }
    else if (Chip_idx == 4) // Hepsini seç (All Selected - Init & Clear için)
    {
        CS1_SetLow();
        CS2_SetLow();
        CS3_SetLow();
    }
    __delay_us(2);
}

void GLCD_Chip_Select(char Chip_idx)
{
    GLCD_Chip_Select_Direct((unsigned char)Chip_idx);
}

//-------------------------------------------------------------------------------------------------
// MCC Pin Makroları İle Doğrudan Donanıma Komut Gönderme
//-------------------------------------------------------------------------------------------------
void GLCD_Command_Direct(unsigned char command)
{
    TRISD = 0x00;       // PORTD Çıkış
    RW_SetLow();        // RW = 0 (Yazma Modu)
    BUFDIR_SetHigh();   // BUFDIR = 1 (MCU -> LCD)
    BUFEN_SetLow();     // BUFEN = 0 (Tampon Etkin)
    BUFE2_SetLow();     // BUFE2 = 0 (Ek Tampon Etkin)
    __delay_us(1);

    LATD = command;     // Komut Byte'ını Data Bus'a Koy
    RS_SetLow();        // RS = 0 (Komut Modu)
    __delay_us(1);

    EN_SetHigh();       // EN = 1 (Enable Strobe YÜKSEK)
    __delay_us(2);
    EN_SetLow();        // EN = 0 (Enable Strobe DÜŞÜK - Düşen Kenarda İşlenir)
    __delay_us(2);

    BUFEN_SetHigh();    // BUFEN Deaktif
    BUFE2_SetHigh();    // BUFE2 Deaktif
}

void GLCD_Command(char Command)
{
    GLCD_Command_Direct((unsigned char)Command);
}

//-------------------------------------------------------------------------------------------------
// MCC Pin Makroları İle Doğrudan Donanıma Veri Gönderme
//-------------------------------------------------------------------------------------------------
void GLCD_Data_Direct(unsigned char data)
{
    TRISD = 0x00;       // PORTD Çıkış
    RW_SetLow();        // RW = 0 (Yazma Modu)
    BUFDIR_SetHigh();   // BUFDIR = 1 (MCU -> LCD)
    BUFEN_SetLow();     // BUFEN = 0 (Tampon Etkin)
    BUFE2_SetLow();     // BUFE2 = 0 (Ek Tampon Etkin)
    __delay_us(1);

    LATD = data;        // Veri Byte'ını Data Bus'a Koy
    RS_SetHigh();       // RS = 1 (Veri Modu)
    __delay_us(1);

    EN_SetHigh();       // EN = 1 (Enable Strobe YÜKSEK)
    __delay_us(2);
    EN_SetLow();        // EN = 0 (Enable Strobe DÜŞÜK - Düşen Kenarda Yazılır)
    __delay_us(2);

    BUFEN_SetHigh();    // BUFEN Deaktif
    BUFE2_SetHigh();    // BUFE2 Deaktif
}

void GLCD_Data(char Data)
{
    GLCD_Data_Direct((unsigned char)Data);
}

//-------------------------------------------------------------------------------------------------
// GLCD Doğrudan Konumlandırma (x: 0..191 piksel, page: 0..7 sayfa adresi)
//-------------------------------------------------------------------------------------------------
void GLCD_GoTo_Direct(unsigned char x, unsigned char page)
{
    unsigned char chip;
    unsigned char column;

    if (x >= 192 || page >= 8) return;

    chip = (x / 64) + 1; // 1: Sol (0..63), 2: Orta (64..127), 3: Sağ (128..191) Çip
    column = x % 64;     // Çip içi sütun adresi (0..63)

    GLCD_Chip_Select_Direct(chip);
    GLCD_Command_Direct(DISPLAY_SET_X_CMD | page);   // Page (0xB8 + page)
    GLCD_Command_Direct(DISPLAY_SET_Y_CMD | column); // Sütun (0x40 + column)
}

void GLCD_GoTo(unsigned char x, unsigned char y)
{
    screen_x = x;
    screen_y = y;
    GLCD_GoTo_Direct(x, y / 8);
}

//-------------------------------------------------------------------------------------------------
// GLCD Başlatma Fonksiyonu
//-------------------------------------------------------------------------------------------------
void GLCD_Init(void)
{
    ANSELD = 0x00;              // PORTD Dijital Mod
    TRISD = 0x00;               // Data Bus Çıkış
    BUFE2_SetHigh();            // BUFE2 Deaktif

    GLCD_Chip_Select_Direct(4); // Tüm Çipleri Seç
    __delay_ms(10);

    GLCD_Command_Direct(DISPLAY_OFF_CMD);           // Ekran Kapalı (0x3E)
    GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);     // Column = 0
    GLCD_Command_Direct(DISPLAY_SET_X_CMD | 0);     // Page = 0
    GLCD_Command_Direct(DISPLAY_START_LINE_CMD | 0);// Start Line = 0
    GLCD_Command_Direct(DISPLAY_ON_CMD);            // Ekran Açık (0x3F)

    GLCD_Chip_Select_Direct(0); // Seçimleri Kaldır
    GLCD_ClearAll();            // Ekrana İlk Temizlik
}

//-------------------------------------------------------------------------------------------------
// Tüm RAM Tamponunu Ekrana Yansıtma (Aşırı Hızlı Tek Geçişli Donanım Render)
//-------------------------------------------------------------------------------------------------
void GLCD_Render(void)
{
    unsigned char page, col;
    unsigned short ptr;

    for (page = 0; page < 8; page++)
    {
        ptr = (unsigned short)page * 192;

        // Çip 1 (Sol 64 Sütun)
        GLCD_Chip_Select_Direct(1);
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | page);
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);
        for (col = 0; col < 64; col++)
        {
            GLCD_Data_Direct(glcd_buffer[ptr + col]);
        }

        // Çip 2 (Orta 64 Sütun)
        GLCD_Chip_Select_Direct(2);
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | page);
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);
        for (col = 0; col < 64; col++)
        {
            GLCD_Data_Direct(glcd_buffer[ptr + 64 + col]);
        }

        // Çip 3 (Sağ 64 Sütun)
        GLCD_Chip_Select_Direct(3);
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | page);
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);
        for (col = 0; col < 64; col++)
        {
            GLCD_Data_Direct(glcd_buffer[ptr + 128 + col]);
        }
    }
    GLCD_Chip_Select_Direct(0);
}

//-------------------------------------------------------------------------------------------------
// GLCD Tüm Ekranı Temizleme (RAM Buffera Yazıp Donanıma Anında Yansıtma)
//-------------------------------------------------------------------------------------------------
void GLCD_ClearAll(void)
{
    memset(glcd_buffer, 0x00, 1536);
    GLCD_Render();
}

//-------------------------------------------------------------------------------------------------
// Veri Yazma Fonksiyonları (Y Kaydırma / Maskeleme İle Pürüzsüz Font Desteği)
//-------------------------------------------------------------------------------------------------
void GLCD_WriteData(unsigned char dataToWrite)
{
    unsigned char yOffset = screen_y % 8;
    unsigned char page = screen_y / 8;
    unsigned short idx = (unsigned short)page * 192 + screen_x;

