narmesk/testjules1/PIC18FREMOTE/glcd.c
    if (screen_x < 192 && page < 8)
    {
        if (yOffset == 0)
        {
            glcd_buffer[idx] = dataToWrite;
            GLCD_GoTo_Direct(screen_x, page);
            GLCD_Data_Direct(glcd_buffer[idx]);
        }
        else
        {
            unsigned char mask1 = ~(0xFF << yOffset);
            glcd_buffer[idx] = (glcd_buffer[idx] & mask1) | (dataToWrite << yOffset);
            GLCD_GoTo_Direct(screen_x, page);
            GLCD_Data_Direct(glcd_buffer[idx]);

            if (page + 1 < 8)
            {
                unsigned short idx2 = (unsigned short)(page + 1) * 192 + screen_x;
                unsigned char mask2 = ~(0xFF >> (8 - yOffset));
                glcd_buffer[idx2] = (glcd_buffer[idx2] & mask2) | (dataToWrite >> (8 - yOffset));
                GLCD_GoTo_Direct(screen_x, page + 1);
                GLCD_Data_Direct(glcd_buffer[idx2]);
            }
        }
    }
    screen_x++;
}

void GLCDWriteData(unsigned char data)
{
    unsigned char yOffset = Coord.y % 8;
    unsigned char page = Coord.y / 8;
    unsigned short idx = (unsigned short)page * 192 + Coord.x;

    if (Coord.x < 192 && page < 8)
    {
        if (yOffset == 0)
        {
            glcd_buffer[idx] = data;
            GLCD_GoTo_Direct(Coord.x, page);
            GLCD_Data_Direct(glcd_buffer[idx]);
        }
        else
        {
            unsigned char mask1 = ~(0xFF << yOffset);
            glcd_buffer[idx] = (glcd_buffer[idx] & mask1) | (data << yOffset);
            GLCD_GoTo_Direct(Coord.x, page);
            GLCD_Data_Direct(glcd_buffer[idx]);

            if (page + 1 < 8)
            {
                unsigned short idx2 = (unsigned short)(page + 1) * 192 + Coord.x;
                unsigned char mask2 = ~(0xFF >> (8 - yOffset));
                glcd_buffer[idx2] = (glcd_buffer[idx2] & mask2) | (data >> (8 - yOffset));
                GLCD_GoTo_Direct(Coord.x, page + 1);
                GLCD_Data_Direct(glcd_buffer[idx2]);
            }
        }
    }
    Coord.x++;
}

void GotoXY(unsigned char x, unsigned char y)
{
    Coord.x = x;
    Coord.y = y;
}

//-------------------------------------------------------------------------------------------------
// MCU RAM Tamponu Kullanan Grafik Çizim Fonksiyonları (Otomatik Anında Donanıma Yansır)
//-------------------------------------------------------------------------------------------------

// Tek Piksel Çizimi / Silimi (RAM Buffera Yazar ve Anında Donanıma Yansıtır)
void GLCD_SetPixel(unsigned char x, unsigned char y, unsigned char color)
{
    unsigned char page = y / 8;
    unsigned char bit_pos = y % 8;
    unsigned short idx;

    if (x >= 192 || y >= 64) return;

    idx = (unsigned short)page * 192 + x;

    if (color == BLACK)
    {
        glcd_buffer[idx] |= (1 << bit_pos);
    }
    else
    {
        glcd_buffer[idx] &= ~(1 << bit_pos);
    }

    // Anında donanıma yaz
    GLCD_GoTo_Direct(x, page);
    GLCD_Data_Direct(glcd_buffer[idx]);
}

// Çerçeve Dikdörtgen Çizimi
void GLCD_Rectangle(unsigned char x, unsigned char y, unsigned char b, unsigned char a, unsigned char color)
{
    unsigned char j;
    for (j = x; j <= b; j++)
    {
        GLCD_SetPixel(j, y, color);
        GLCD_SetPixel(j, a, color);
    }
    for (j = y; j <= a; j++)
    {
        GLCD_SetPixel(x, j, color);
        GLCD_SetPixel(b, j, color);
    }
}

// Dolu Dikdörtgen Çizimi (RAM'de İşleyip Donanıma Hızlıca Blok Halinde Aktarır)
void GLCD_Rectangle_Fill(unsigned char x, unsigned char y, unsigned char b, unsigned char a, unsigned char color)
{
    unsigned char curr_x, curr_y;
    unsigned char start_page = y / 8;
    unsigned char end_page = a / 8;
    unsigned char page, bit_pos;
    unsigned short idx;

    if (x >= 192) x = 191;
    if (b >= 192) b = 191;
    if (y >= 64) y = 63;
    if (a >= 64) a = 63;

    // RAM tamponunu güncelle
    for (curr_x = x; curr_x <= b; curr_x++)
    {
        for (curr_y = y; curr_y <= a; curr_y++)
        {
            page = curr_y / 8;
            bit_pos = curr_y % 8;
            idx = (unsigned short)page * 192 + curr_x;

            if (color == BLACK)
            {
                glcd_buffer[idx] |= (1 << bit_pos);
            }
            else
            {
                glcd_buffer[idx] &= ~(1 << bit_pos);
            }
        }
    }

    // Donanımı hızla güncelle (< 5 ms)
    for (page = start_page; page <= end_page; page++)
    {
        for (curr_x = x; curr_x <= b; curr_x++)
        {
            if (curr_x == x || curr_x == 64 || curr_x == 128)
            {
                GLCD_GoTo_Direct(curr_x, page);
            }
            idx = (unsigned short)page * 192 + curr_x;
            GLCD_Data_Direct(glcd_buffer[idx]);
        }
    }
    GLCD_Chip_Select_Direct(0);
}

// Alan Doldurma
void SetPixels(unsigned char x, unsigned char y, unsigned char x2, unsigned char y2, unsigned char color)
{
    GLCD_Rectangle_Fill(x, y, x2, y2, color);
}

// Çizgi Çizimi
void GLCD_Line(unsigned char X1, unsigned char Y1, unsigned char X2, unsigned char Y2, unsigned char color)
{
    int CurrentX, CurrentY, Xinc, Yinc,
            Dx, Dy, TwoDx, TwoDy,
            TwoDxAccumulatedError, TwoDyAccumulatedError;

    Dx = (X2 - X1);
    Dy = (Y2 - Y1);

    TwoDx = Dx + Dx;
    TwoDy = Dy + Dy;

    CurrentX = X1;
    CurrentY = Y1;

    Xinc = 1;
    Yinc = 1;

    if (Dx < 0)
    {
        Xinc = -1;
        Dx = -Dx;
        TwoDx = -TwoDx;
    }

    if (Dy < 0)
    {
        Yinc = -1;
        Dy = -Dy;
        TwoDy = -TwoDy;
    }

    GLCD_SetPixel(X1, Y1, color);

    if ((Dx != 0) || (Dy != 0))
    {
        if (Dy <= Dx)
        {
            TwoDxAccumulatedError = 0;
            do
            {
                CurrentX += Xinc;
                TwoDxAccumulatedError += TwoDy;
                if (TwoDxAccumulatedError > Dx)
                {
                    CurrentY += Yinc;
                    TwoDxAccumulatedError -= TwoDx;
                }
                GLCD_SetPixel(CurrentX, CurrentY, color);
            }
            while (CurrentX != X2);
        }
        else
        {
            TwoDyAccumulatedError = 0;
            do
            {
                CurrentY += Yinc;
                TwoDyAccumulatedError += TwoDx;
                if (TwoDyAccumulatedError > Dy)
                {
                    CurrentX += Xinc;
                    TwoDyAccumulatedError -= TwoDy;
                }
                GLCD_SetPixel(CurrentX, CurrentY, color);
            }
            while (CurrentY != Y2);
        }
    }
}

// Çember Çizimi
void GLCD_Circle(unsigned char cx, unsigned char cy, unsigned char radius, unsigned char color)
{
    int x, y, xchange, ychange, radiusError;
    x = radius;
    y = 0;
    xchange = 1 - 2 * radius;
    ychange = 1;
    radiusError = 0;
    while (x >= y)
    {
        GLCD_SetPixel(cx + x, cy + y, color);
        GLCD_SetPixel(cx - x, cy + y, color);
        GLCD_SetPixel(cx - x, cy - y, color);
        GLCD_SetPixel(cx + x, cy - y, color);
        GLCD_SetPixel(cx + y, cy + x, color);
        GLCD_SetPixel(cx - y, cy + x, color);
        GLCD_SetPixel(cx - y, cy - x, color);
        GLCD_SetPixel(cx + y, cy - x, color);
        y++;
        radiusError += ychange;
        ychange += 2;
        if (2 * radiusError + xchange > 0)
        {
            x--;
            radiusError += xchange;
            xchange += 2;
        }
    }
}

// Dolu Çember Çizimi
void GLCD_Circle_Fill(unsigned char cx, unsigned char cy, unsigned char radius, unsigned char color)
{
    unsigned char temp = radius;
    while (temp > 0)
    {
        GLCD_Circle(cx, cy, temp, color);
        temp--;
    }
}

//-------------------------------------------------------------------------------------------------
// Metin ve Font Fonksiyonları (MCU RAM Buffera Yazıp Donanıma Anında Basar)
//-------------------------------------------------------------------------------------------------
void GLCD_String5x7(unsigned char x, unsigned char y, char *str)
{
    unsigned char i = 0;
    unsigned char curr_x = x;

