narmesk/testjules1/PIC18FREMOTE/glcd.c
void GLCDPutCharDigMax(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (39 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 14;
}

void GLCDPutCharDigMaxFirst(unsigned char c)
{
    unsigned short index;
    c -= '+';
    index = (39 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
}

void GLCDPutCharDigMaxSecond(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (39 * c) + 42 + FONT_WIDTH_TABLE;
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 14;
}

// Resim basma fonksiyonları (RAM Tamponuna ve Donanıma Yazma)
void GLCD_Picture(char *str)
{
    memcpy(glcd_buffer, str, 1536);
    GLCD_Render();
}
